darrylburke/heltec_arduino_wifi_Device_AP_Detector_LCD/esp8266_Client_AP_Scanner/functions.h
// This-->tab == "functions.h"

// Expose Espressif SDK functionality
extern "C" {
#include "user_interface.h"
  typedef void (*freedom_outside_cb_t)(uint8 status);
  int  wifi_register_send_pkt_freedom_cb(freedom_outside_cb_t cb);
  void wifi_unregister_send_pkt_freedom_cb(void);
  int  wifi_send_pkt_freedom(uint8 *buf, int len, bool sys_seq);
}

#include <ESP8266WiFi.h>
#include "./structures.h"

#define MAX_APS_TRACKED 100
#define MAX_CLIENTS_TRACKED 200

beaconinfo aps_known[MAX_APS_TRACKED];                    // Array to save MACs of known APs
int aps_known_count = 0;                                  // Number of known APs
int nothing_new = 0;
clientinfo clients_known[MAX_CLIENTS_TRACKED];            // Array to save MACs of known CLIENTs
int clients_known_count = 0;                              // Number of known CLIENTs

int register_beacon(beaconinfo beacon)
{
 // print2_beacon(beacon);
  
  int known = 0;   // Clear known flag
  for (int u = 0; u < aps_known_count; u++)
  {
    if (! memcmp(aps_known[u].bssid, beacon.bssid, ETH_MAC_LEN)) {
      known = 1;
      break;
    }   // AP known => Set known flag
  }
  if (! known)  // AP is NEW, copy MAC to array and return it
  {
    memcpy(&aps_known[aps_known_count], &beacon, sizeof(beacon));
    aps_known_count++;

    if ((unsigned int) aps_known_count >=
        sizeof (aps_known) / sizeof (aps_known[0]) ) {
      if (doprint) Serial.printf("exceeded max aps_known\n");
      aps_known_count = 0;
    }
  }
  return known;
}

int register_client(clientinfo ci)
{
  int known = 0;   // Clear known flag
  for (int u = 0; u < clients_known_count; u++)
  {
    if (! memcmp(clients_known[u].station, ci.station, ETH_MAC_LEN)) {
      known = 1;
      break;
    }
  }
  if (! known)
  {
    memcpy(&clients_known[clients_known_count], &ci, sizeof(ci));
    clients_known_count++;

    if ((unsigned int) clients_known_count >=
        sizeof (clients_known) / sizeof (clients_known[0]) ) {
      Serial.printf("exceeded max clients_known\n");
      clients_known_count = 0;
    }
  }
  return known;
}
int counter = 0;
int maxcounter=0;
int lcdline=1;
int maxlcdline = 4;

void displayBeacon(beaconinfo beacon){

#ifdef LCD
  String stringMOne =  String("MAC:[ ");  
  for (int i = 0; i < 6; i++)  {
    stringMOne =  String(stringMOne + String(beacon.bssid[i],HEX));  
    if (i < 5) {
      stringMOne =  String(stringMOne + String(":"));
    }
  }
  String stringMThree =  String(stringMOne + " ]");

  if (lcdline == 1) {

    heltecDisplayMsg(stringMThree,0,lcdline,true,false);

  }else if (lcdline > 1 && lcdline < maxlcdline) {

     heltecDisplayMsg(stringMThree,0,lcdline,false,false);

  } else if (lcdline >= maxlcdline ) {
    heltecDisplayMsg(stringMThree,0,lcdline,false,false);
    lcdline=0;
  }
  lcdline++;
#endif
}
void print_beacon(beaconinfo beacon)
{
  if (beacon.err == 0)
    {
      if (doprint) {
        Serial.printf("BEACON: <=============== [%32s]  ", beacon.ssid);
        for (int i = 0; i < 6; i++) Serial.printf("%02x", beacon.bssid[i]);
        Serial.printf("   %2d", beacon.channel);
        Serial.printf("   %4d\r\n", beacon.rssi);
      }
   
  } else if (beacon.err == -4)
    {
    counter++;
    if (doprint) {
      Serial.printf("BEACON: <===(UNASSOC.)== [%32s]  ", beacon.ssid);
      for (int i = 0; i < 6; i++) Serial.printf("%02x:", beacon.bssid[i]);
      Serial.printf("   %2d", beacon.channel);
      Serial.printf("   %4d\r\n", beacon.rssi);
    }
    if (counter > maxcounter) {
          displayBeacon(beacon);
          counter=1;
    }
  } 
  else{
    //Serial.printf("BEACON ERR: (%d)  \n", beacon.err);
  }   
}



void print_client(clientinfo ci)
{
  int u = 0;
  int known = 0;   // Clear known flag
  if (ci.err != 0) {
    // nothing
  } else {
    Serial.printf("DEVICE: ");
    for (int i = 0; i < 6; i++) Serial.printf("%02x", ci.station[i]);
    Serial.printf(" ==> ");

    for (u = 0; u < aps_known_count; u++)
    {
      if (! memcmp(aps_known[u].bssid, ci.bssid, ETH_MAC_LEN)) {
        Serial.printf("[%32s]", aps_known[u].ssid);
        known = 1;     // AP known => Set known flag
        break;
      }
    }

    if (! known)  {
      Serial.printf("   Unknown/Malformed packet \r\n");
      //  for (int i = 0; i < 6; i++) Serial.printf("%02x", ci.bssid[i]);
    } else {
      Serial.printf("%2s", " ");
      for (int i = 0; i < 6; i++) Serial.printf("%02x", ci.ap[i]);
      Serial.printf("  %3d", aps_known[u].channel);
      Serial.printf("   %4d\r\n", ci.rssi);
    }
  }
}

void promisc_cb(uint8_t *buf, uint16_t len)
{
  int i = 0;
  uint16_t seq_n_new = 0;
  if (len == 12) {
    struct RxControl *sniffer = (struct RxControl*) buf;
  } else if (len == 105) {
     Serial.printf("C:");
     for (int i = 0; i < 105; i++) Serial.printf("%02x", buf[i]);
     Serial.printf("\n");
  } else if (len == 128) {
    //Attached and Unattached clients are both len=128 
    struct sniffer_buf2 *sniffer = (struct sniffer_buf2*) buf;
    struct beaconinfo beacon = parse_beacon(sniffer->buf, 112, sniffer->rx_ctrl.rssi);
    if (register_beacon(beacon) == 0) {
      print_beacon(beacon);
      nothing_new = 0;
    } else {
     //  Serial.printf(" Fail\n");
    }
  } else {
    struct sniffer_buf *sniffer = (struct sniffer_buf*) buf;
    //Is data or QOS?
    if ((sniffer->buf[0] == 0x08) || (sniffer->buf[0] == 0x88)) {    
      struct clientinfo ci = parse_data(sniffer->buf, 36, sniffer->rx_ctrl.rssi, sniffer->rx_ctrl.channel);
      if (memcmp(ci.bssid, ci.station, ETH_MAC_LEN)) {
        if (register_client(ci) == 0) {
         if(doprint)  print_client(ci);
          nothing_new = 0;
        }
      }
    }
  }
}

